{
	"sidebar": {
		"name": "Diego Rubí",
		"title": "Desarrollador Móvil",
		"showContactsBtn": "Mostrar Contactos",
		"contacts": {
			"email": {
				"title": "Correo Electrónico",
				"linkText": "drubico@gmail.com",
				"linkHref": "mailto:drubico@gmail.com"
			},
			"phone": {
				"title": "Teléfono",
				"linkText": "+503 78508012",
				"linkHref": "tel:+50378508012"
			},
			"birthday": {
				"title": "Cumpleaños",
				"date": "14 de febrero, 1999",
				"datetime": "1999-02-14"
			},
			"location": {
				"title": "Ubicación",
				"address": "San Salvador, El Salvador"
			},
			"linkedin": {
				"title": "LinkedIn",
				"linkText": "Diego Alejandro Rubi",
				"linkHref": "https://www.linkedin.com/in/drubico/"
			}
		}
	},
	"navbar": {
		"about": "Perfil",
		"resume": "Currículum",
		"portfolio": "Proyectos",
		"contact": "Contacto"
	},
	"about": {
		"title": "Acerca de mí",
		"intro": "Soy un Desarrollador Móvil con Kotlin y Flutter de El Salvador, trabajando en el desarrollo soluciones digitales. Disfruto convertir problemas complejos en aplicaciones simples, hermosas e intuitivas.",
		"description": "Mi trabajo es construir tu aplicación móvil para que sea funcional y fácil de usar, pero al mismo tiempo atractiva. Además, le doy un toque personal a tu producto y me aseguro de que sea llamativo y fácil de utilizar. Mi objetivo es transmitir tu mensaje e identidad de la manera más creativa posible. He creado aplicaciones móviles para muchas empresas de renombre.",
		"services": {
			"title": "Servicios",
			"mobileApps": {
				"title": "Aplicaciones móviles",
				"description": "Desarrollo profesional de aplicaciones Android con Flutter y Kotlin, aprendiendo Swift."
			},
			"webDevelopment": {
				"title": "Desarrollo web",
				"description": "Aprendiendo desarrollo web."
			}
		},
		"skills": {
			"title": "Habilidades",
			"android": {
				"title": "Desarrollador Android (Kotlin/Java)",
				"progress": "80%"
			},
			"flutter": {
				"title": "Desarrollador Flutter",
				"progress": "60%"
			},
			"backend": {
				"title": "Backend Node JS",
				"progress": "60%"
			},
			"wordpress": {
				"title": "WordPress",
				"progress": "50%"
			}
		}
	},
	"resume": {
		"title": "Currículum",
		"education": {
			"title": "Educación",
			"items": [
				{
					"institution": "Universidad Centroamericana Jose Simeon Cañas",
					"dates": "2017 — Presente",
					"description": "Durante mi tiempo en la universidad, aprendí sobre varios temas, incluyendo seguridad, redes, desarrollo Android, desarrollo web, APIs, programación orientada a objetos y programación dinámica."
				}
			]
		},
		"experience": {
			"title": "Experiencia",
			"items": [
				{
					"position": "Desarrollador Móvil - Secretaría de Innovación de la Presidencia",
					"dates": "10/2022 — Presente",
					"details": [
						"Desarrollé aplicaciones nativas con Kotlin y Jetpack Compose para Android.",
						"Desarrollador de software con experiencia en desarrollo de aplicaciones móviles y web. Experto en Kotlin, Jetpack Compose, Flutter y Node.js. Enfoque en la implementación de arquitecturas limpias y metodologías ágiles para optimizar el desarrollo de software.",
						"Desarrollé aplicaciones multiplataforma con Flutter.",
						"Integré bibliotecas como Retrofit, Glide y Room para mejorar la funcionalidad y el rendimiento de las aplicaciones."
					]
				},
				{
					"position": "Desarrollador Móvil - Ministerio de Salud",
					"dates": "2/2022 — 10/2022",
					"details": [
						"Creé APIs con Node.js.",
						"Actualice aplicaciones nativas con Java y Kotlin.",
						"Optimicé aplicaciones existentes y mejoré la experiencia de usuario.",
						"Implementé bibliotecas como Dagger Hilt para inyección de dependencias."
					]
				},
				{
					"position": "Desarrollador WordPress - The Virtual Buddy",
					"dates": "01/2021 — 06/2021",
					"details": ["Desarrollé aplicaciones con WordPress, siguiendo un diseño y asegurando la mejor experiencia de usuario."]
				}
			]
		}
	},
	"portfolio": {
		"title": "Portafolio",
		"filter": {
			"all": "Todo",
			"applications": "Aplicaciones",
			"webDevelopment": "Desarrollo web"
		},
		"projects": [
			{
				"title": "Finflex",
				"category": "Aplicaciones",
				"description": "Presentamos <strong>FinFlex</strong>, una aplicación integral e intuitiva diseñada para ayudarte a gestionar tus tarjetas de crédito de manera eficiente y sin esfuerzo. FinFlex permite a los usuarios rastrear pagos, monitorear saldos y estar al tanto del crédito disponible, proporcionando información financiera precisa y confiable. La aplicación también ofrece un desglose detallado de las categorías de gastos, los plazos de pago próximos y consejos personalizados para optimizar el uso del crédito. Con su diseño fácil de usar, actualizaciones en tiempo real y análisis detallados, FinFlex es la herramienta perfecta para ayudar a los usuarios a mantener el control de sus finanzas, evitar pagos atrasados y maximizar los beneficios de sus tarjetas de crédito con transparencia y facilidad.",
				"languages": ["Kotlin"],
				"frameworks": ["Jetpack Compose"],
				"libraries": ["Firebase", "Glide", "Chart", "Hilt"]
			},
			{
				"title": "Salario Sv",
				"category": "Aplicaciones",
				"description": "Presentamos <strong>Salario SV</strong>, una aplicación integral e intuitiva diseñada para calcular tu salario neto en El Salvador después de aplicar las deducciones obligatorias. Salario SV permite a los usuarios calcular fácilmente las contribuciones como AFP (7.25%), ISSS (3% con un máximo limitado) e impuesto sobre la renta (renta), proporcionando resultados precisos y confiables. La aplicación también ofrece información sobre las contribuciones del empleador para AFP (8.75%) e ISSS (7.5%), brindando a los usuarios una visión completa de la estructura de su salario. Con su diseño fácil de usar, desgloses detallados y cálculos en tiempo real, Salario SV es la herramienta perfecta para ayudar a los empleados a gestionar sus finanzas de manera efectiva y transparente.",
				"languages": ["Kotlin"],
				"frameworks": ["Jetpack Compose"],
				"libraries": ["Firebase", "Coil", "Chart", "Koin"],
				"links": {
					"playstore": {
						"title": "Ir a Play Store",
						"link": "https://play.google.com/store/apps/details?id=com.drubico.salariosv"
					}
				}
			},
			{
				"title": "Combo Vip",
				"category": "Desarrollo web",
				"description": "Esta aplicación ofrece una experiencia fluida y segura, permitiendo a los clientes VIP proporcionar comentarios personalizados a través de encuestas intuitivas. Con información en tiempo real, diseño responsivo e integración con sistemas existentes, la aplicación permite a Impresa Repuestos comprender mejor las necesidades de los clientes, mejorar los servicios y fortalecer las relaciones, todo mientras mantiene los más altos estándares de seguridad de datos y profesionalismo.",
				"languages": ["C#", "CSS", "HTML", "JavaScript"],
				"frameworks": ["Blazor"],
				"libraries": ["Tailwind CSS", "PDFSharp"]
			},
			{
				"title": "Dires Cup",
				"category": "Aplicaciones",
				"description": "Presentamos DireCup, una aplicación moderna diseñada para llevar el registro de los puntajes de los partidos amistosos de fútbol entre amigos. Esta aplicación proporciona una experiencia fluida e intuitiva, permitiendo a los usuarios ver los resultados de los partidos, las posiciones de los equipos y las posiciones en la liga en tiempo real. Con su diseño responsivo, fácil navegación y manejo seguro de datos, DireCup ayuda a los entusiastas del fútbol a mantenerse conectados e informados, fomentando la competencia amistosa y fortaleciendo la camaradería entre los participantes.",
				"languages": ["Kotlin"],
				"frameworks": ["Jetpack Compose"],
				"libraries": ["Firebase", "Glide", "Hilt"],
				"links": {
					"playstore": {
						"title": "Ir a Play Store",
						"link": "https://play.google.com/store/apps/details?id=com.drubi.diresCup"
					}
				}
			}
		]
	},
	"contact": {
		"title": "Contacto",
		"formTitle": "Contacta conmigo",
		"linkedinProfile": "Perfil de LinkedIn",
		"githubProfile": "Perfil de GitHub",
		"playStoreProfile": "Perfil de Play Store"
	}
}
