{
	"sidebar": {
		"name": "Diego Rubí",
		"title": "Mobile Developer",
		"showContactsBtn": "Show Contacts",
		"contacts": {
			"email": {
				"title": "Email",
				"linkText": "drubico@gmail.com",
				"linkHref": "mailto:drubico@gmail.com"
			},
			"phone": {
				"title": "Phone",
				"linkText": "+503 78508012",
				"linkHref": "tel:+50378508012"
			},
			"birthday": {
				"title": "Birthday",
				"date": "February 14, 1999",
				"datetime": "1999-02-14"
			},
			"location": {
				"title": "Location",
				"address": "San Salvador, El Salvador"
			},
			"linkedin": {
				"title": "LinkedIn",
				"linkText": "Diego Alejandro Rubi",
				"linkHref": "https://www.linkedin.com/in/drubico/"
			}
		}
	},
	"navbar": {
		"about": "About",
		"resume": "Resume",
		"portfolio": "Portfolio",
		"contact": "Contact"
	},
	"about": {
		"title": "About me",
		"intro": "I am a Mobile Developer with Kotlin and Flutter from El Salvador, working in digital solutions. I enjoy turning complex problems into simple, beautiful, and intuitive applications.",
		"description": "My job is to build your mobile application so that it is functional and user-friendly but at the same time attractive. Additionally, I add a personal touch to your product and make sure it is eye-catching and easy to use. My goal is to convey your message and identity in the most creative way possible. I have created mobile applications for many renowned companies.",
		"tittle-what-im-doing": "What I'm doing",
		"services": {
			"title": "Services",
			"mobileApps": {
				"title": "Mobile apps",
				"description": "Professional development of Android applications with Flutter and Kotlin, learning Swift."
			},
			"webDevelopment": {
				"title": "Web development",
				"description": "Learning web development."
			}
		},
		"skills": {
			"title": "Skills",
			"android": {
				"title": "Android (Kotlin/Java) Developer",
				"progress": "80%"
			},
			"flutter": {
				"title": "Flutter Developer",
				"progress": "60%"
			},
			"backend": {
				"title": "Backend Node JS",
				"progress": "60%"
			},
			"wordpress": {
				"title": "WordPress",
				"progress": "50%"
			}
		}
	},
	"resume": {
		"title": "Resume",
		"education": {
			"title": "Education",
			"items": [
				{
					"institution": "Universidad Centroamericana Jose Simeon Cañas",
					"dates": "2017 — Present",
					"description": "During my time at university, I learned about various topics including security, networks, Android development, web development, APIs, object-oriented programming, and dynamic programming."
				}
			]
		},
		"experience": {
			"title": "Experience",
			"items": [
				{
					"position": "Mobile Developer - Secretaria de Innovación de la Presidencia",
					"dates": "10/2022 — Present",
					"details": [
						"Developed native applications with Kotlin and Jetpack Compose for Android.",
						"Software developer with experience in mobile and web application development. Expert in Kotlin, Jetpack Compose, Flutter, and Node.js. Focused on implementing clean architectures and agile methodologies to optimize software development.",
						"Developed cross-platform applications with Flutter.",
						"Integrated libraries such as Retrofit, Glide, and Room to enhance application functionality and performance."
					]
				},
				{
					"position": "Mobile Developer - Ministerio de Salud",
					"dates": "2/2022 — 10/2022",
					"details": [
						"Created APIs with Node.js.",
						"Maintained native applications with Java and Kotlin.",
						"Optimized existing applications and improved user experience.",
						"Implemented libraries such as Dagger Hilt for dependency injection."
					]
				},
				{
					"position": "WordPress Developer - The Virtual Buddy",
					"dates": "01/2021 — 06/2021",
					"details": ["I developed applications with WordPress, following a design and ensuring the best user experience."]
				}
			]
		}
	},
	"portfolio": {
		"title": "Portfolio",
		"filter": {
			"all": "All",
			"applications": "Applications",
			"webDevelopment": "Web development"
		},
		"technologies": {
			"title": "Technologies",
			"languages": "Languages",
			"frameworks": "Frameworks",
			"libraries": "Libraries"
		},
		"projects": [
			{
				"title": "Finflex",
				"category": "Applications",
				"description": "Introducing <strong>FinFlex</strong>, a comprehensive and intuitive application designed to help you manage your credit cards efficiently and effortlessly. FinFlex allows users to easily track payments, monitor balances, and keep an eye on available credit, delivering precise and reliable financial insights. The app also provides a detailed breakdown of spending categories, upcoming payment deadlines, and personalized tips to optimize your credit usage. With its user-friendly design, real-time updates, and detailed analytics, FinFlex is the perfect tool to help users stay in control of their finances, avoid late payments, and maximize their credit card benefits with transparency and ease.",
				"languages": ["Kotlin"],
				"frameworks": ["Jetpack Compose"],
				"libraries": ["Firebase", "Glide", "Chart", "Hilt"]
			},
			{
				"title": "Salario Sv",
				"category": "Applications",
				"description": "Introducing <strong>Salario SV</strong>, a comprehensive and intuitive application designed to calculate your net salary in El Salvador after applying mandatory deductions. Salario SV allows users to easily compute contributions such as AFP (7.25%), ISSS (3% with a capped maximum), and income tax (renta), delivering precise and reliable results. The app also provides insights into employer contributions for AFP (8.75%) and ISSS (7.5%), giving users a complete view of their salary structure. With its user-friendly design, detailed breakdowns, and real-time calculations, Salario SV is the perfect tool to help employees manage their finances effectively and transparently.",
				"languages": ["Kotlin"],
				"frameworks": ["Jetpack Compose"],
				"libraries": ["Firebase", "Coil", "Chart", "Koin"],
				"links": {
					"playstore": {
						"title": "Go to Play Store",
						"link": "https://play.google.com/store/apps/details?id=com.drubico.salariosv"
					}
				}
			},
			{
				"title": "Combo Vip",
				"category": "Web development",
				"description": "This application offers a seamless and secure experience, allowing VIP customers to provide personalized feedback through intuitive surveys. With real-time insights, responsive design, and integration with existing systems, the app empowers Impresa Repuesto to understand client needs better, improve services, and strengthen relationships, all while maintaining the highest standards of data security and professionalism.",
				"languages": ["C#", "css", "html", "javascript"],
				"frameworks": ["Blazor"],
				"libraries": ["Tailwind CSS", "PDFSharp"]
			},
			{
				"title": "Dires Cup",
				"category": "Applications",
				"description": "Introducing DireCup, a modern application designed to keep track of match scores for friendly football games among friends. This app provides a seamless and intuitive experience, allowing users to view match results, team standings, and league positions in real-time. With its responsive design, easy navigation, and secure data handling, DireCup helps football enthusiasts stay connected and informed, fostering friendly competition and strengthening camaraderie among participants.",
				"languages": ["Kotlin"],
				"frameworks": ["Jetpack Compose"],
				"libraries": ["Firebase", "Glide", "Hilt"],
				"links": {
					"playstore": {
						"title": "Go to Play Store",
						"link": "https://play.google.com/store/apps/details?id=com.drubi.diresCup"
					}
				}
			}
		]
	},
	"contact": {
		"title": "Contact",
		"formTitle": "Contact Me",
		"linkedinProfile": "LinkedIn Profile",
		"githubProfile": "GitHub Profile",
		"playStoreProfile": "Play Store Profile"
	}
}
